src/test/testtool/ZoekMetGeslachtsnaamEnGeboortedatum/01/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDGR</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDMAG_VnA</applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">0518</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">DEC_ZKN</applicatie>
			<gebruiker xmlns="http://www.egem.nl/StUF/StUF0301">SH2102</gebruiker>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241015062256607</StUF:tijdstipBericht>
		<StUF:crossRefnummer>60c50a8f-d08c-483c-be67-2ab1a6bb9224</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">999992703</inp.bsn>
			<inp.a-nummer xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Rafi</geslachtsnaam>
			<voorvoegselGeslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">El</voorvoegselGeslachtsnaam>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">M.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Mohamed</voornamen>
			<aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<aanhefAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">M</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">19490228</geboortedatum>
			<inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.verblijfBuitenland xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</sub.verblijfBuitenland>
			<sub.correspondentieAdres xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>